In [1]:
# Importing Pandas and Numpy libraries
import pandas as pd
import numpy as np

In [2]:
sales1 = pd.Series([100, 200, 300, 400], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales2 = pd.Series([150, 240, 410, 490], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales3 = pd.Series([300, 400, 500, 600], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])

In [16]:
dataframe1 = pd.DataFrame({2017: sales1, 2018: sales2, 2019: sales3})
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [5]:
# modilied column name
newDataframe1 = dataframe1.rename(columns = {2017 : 2016})
newDataframe1

           2016  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [9]:
newDataframe1 # changes again 2016 to 2017
newDataframe1.rename(columns = {2016:2017}, inplace=True)

In [8]:
newDataframe1

           2016  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [10]:
newDataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [11]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [12]:
# adding another(new) columns
dataframe1.columns

Int64Index([2017, 2018, 2019], dtype='int64')

In [15]:
dataframe1[2016] = ([95, 175, 250, 320])
dataframe1

           2017  2018  2019  2016
Microsoft   100   150   300    95
Facebook    200   240   400   175
Amazon      300   410   500   250
Google      400   490   600   320

In [28]:
dataframe1 = pd.DataFrame({2015: ([95, 175, 250, 320]),2017: sales1, 2018: sales2, 2019: sales3})
dataframe1

           2015  2017  2018  2019
Microsoft    95   100   150   300
Facebook    175   200   240   400
Amazon      250   300   410   500
Google      320   400   490   600

In [29]:
# adding new column to specificy location.
dataframe1.insert(1, 2016,[99, 199, 299, 399])
dataframe1

           2015  2016  2017  2018  2019
Microsoft    95    99   100   150   300
Facebook    175   199   200   240   400
Amazon      250   299   300   410   500
Google      320   399   400   490   600

In [30]:
# renaming column names.
dataframe1.columns = ['A', 'B', 'C', 'D', 'E']
dataframe1

             A    B    C    D    E
Microsoft   95   99  100  150  300
Facebook   175  199  200  240  400
Amazon     250  299  300  410  500
Google     320  399  400  490  600

In [31]:
# A = B-A column
dataframe1.A = dataframe1.B - dataframe1.A
dataframe1

            A    B    C    D    E
Microsoft   4   99  100  150  300
Facebook   24  199  200  240  400
Amazon     49  299  300  410  500
Google     79  399  400  490  600

In [32]:
# 1_deleting column
del dataframe1['A']
dataframe1

             B    C    D    E
Microsoft   99  100  150  300
Facebook   199  200  240  400
Amazon     299  300  410  500
Google     399  400  490  600

In [33]:
# 2_deleting column using pop
pop_method = dataframe1.pop('B')

In [34]:
dataframe1

             C    D    E
Microsoft  100  150  300
Facebook   200  240  400
Amazon     300  410  500
Google     400  490  600

In [35]:
pop_method

Microsoft     99
Facebook     199
Amazon       299
Google       399
Name: B, dtype: int64

In [36]:
# 3_deleting coumn
drop_method = dataframe1.drop(['C'], axis = 1) # axis = 0 delete row
                                               # axis = 1 delete column

In [40]:
drop_method = dataframe1.drop(['Microsoft'], axis=0) # row Microsoft is deleted from drop_method.
drop_method

            C    D    E
Facebook  200  240  400
Amazon    300  410  500
Google    400  490  600